In [1]:
from pymongo import MongoClient

In [2]:
Client = MongoClient(
    host = 'localhost',
    port = 27017
)

In [3]:
Client.list_database_names()

['admin', 'config', 'local', 'test', 'ubion']

In [4]:
db = Client['ubion']
list(db.test.find()) # class에 있는 속성값을 불러오는 행동

[{'_id': ObjectId('62328e7d67d47a2bb1e0dc1b'),
  'name': 'test',
  'phone': '01012345678'}]

In [9]:
data = {
    "1":"1",
    "2":"2",
}
db.test.insert_one(data)

In [14]:
data2 = [{
    "lunch" : "pizza"
},{
    "dinner" : "rice",
    "breakfast" : "bread"
}]
db.test.insert_many(data2)

In [15]:
list(db.test.find())

[{'_id': ObjectId('623290e48bf7f3193cf9e5a5'), 'loc': 'Seoul'},
 {'_id': ObjectId('623290e48bf7f3193cf9e5a6'),
  'gender': 'female',
  'age': 20.0,
  'hobby': 'soccer'},
 {'_id': ObjectId('623297ed38bb8ba60baf9138'), '1': '1', '2': '2'},
 {'_id': ObjectId('623298ed38bb8ba60baf9139'), 'lunch': 'pizza'},
 {'_id': ObjectId('623298ed38bb8ba60baf913a'),
  'dinner': 'rice',
  'breakfast': 'bread'},
 {'_id': ObjectId('623298fa38bb8ba60baf913b'), 'lunch': 'pizza'},
 {'_id': ObjectId('623298fa38bb8ba60baf913c'),
  'dinner': 'rice',
  'breakfast': 'bread'},
 {'_id': ObjectId('623298ff38bb8ba60baf913d'), 'lunch': 'pizza'},
 {'_id': ObjectId('623298ff38bb8ba60baf913e'),
  'dinner': 'rice',
  'breakfast': 'bread'}]

In [20]:
from modules import mod_sql
import pandas as pd

In [17]:
_db = mod_sql.Database()

In [21]:
sql = """
        SELECT * FROM emp
    """
result = _db.executeAll(sql)
result = pd.DataFrame(result)

In [42]:
db.emp.find_one()

{'_id': ObjectId('6232b71828e9c474dad71b3c'),
 'EMPNO': '7369',
 'ENAME': 'SMITH',
 'JOB': 'CLERK',
 'MGR': '7902',
 'HIREDATE': '1980-12-17',
 'SAL': '800.00',
 'DEPTNO': '20'}

In [5]:
# SELECT문의 WHERE과 동일
list(db.emp.find(
    {
        "ENAME" : "SMITH"
    }
))

[{'_id': ObjectId('6232b71828e9c474dad71b3c'),
  'EMPNO': '7369',
  'ENAME': 'SMITH',
  'JOB': 'CLERK',
  'MGR': '7902',
  'HIREDATE': '1980-12-17',
  'SAL': '800.00',
  'DEPTNO': '20'}]

In [7]:
# SELECT문의 WHERE과 동일
result = db.emp.find(
    {}, # where 조건을 쓸 때 사용하는 공간
    {"ENAME" : 1,
    "ENPNO" : 1,
    "DEPTNO" : 1} # key의 값을 선택할 수 있는 공간 
)

# sql문으로 바꾼다면, 
# SELECT EMPNO, ENAME, DEPTNO FROM emp;

In [8]:
for list in result:
    print(list)

{'_id': ObjectId('6232b71828e9c474dad71b3c'), 'ENAME': 'SMITH', 'DEPTNO': '20'}
{'_id': ObjectId('6232b71828e9c474dad71b3d'), 'ENAME': 'ALLEN', 'DEPTNO': '30'}
{'_id': ObjectId('6232b71828e9c474dad71b3e'), 'ENAME': 'WARD', 'DEPTNO': '30'}
{'_id': ObjectId('6232b71828e9c474dad71b3f'), 'ENAME': 'JONES', 'DEPTNO': '20'}
{'_id': ObjectId('6232b71828e9c474dad71b40'), 'ENAME': 'MARTIN', 'DEPTNO': '30'}
{'_id': ObjectId('6232b71828e9c474dad71b41'), 'ENAME': 'BLAKE', 'DEPTNO': '30'}
{'_id': ObjectId('6232b71828e9c474dad71b42'), 'ENAME': 'CLARK', 'DEPTNO': '10'}
{'_id': ObjectId('6232b71828e9c474dad71b43'), 'ENAME': 'SCOTT', 'DEPTNO': '20'}
{'_id': ObjectId('6232b71828e9c474dad71b44'), 'ENAME': 'KING', 'DEPTNO': '10'}
{'_id': ObjectId('6232b71828e9c474dad71b45'), 'ENAME': 'TURNER', 'DEPTNO': '30'}
{'_id': ObjectId('6232b71828e9c474dad71b46'), 'ENAME': 'ADAMS', 'DEPTNO': '20'}
{'_id': ObjectId('6232b71828e9c474dad71b47'), 'ENAME': 'JAMES', 'DEPTNO': '30'}
{'_id': ObjectId('6232b71828e9c474dad71b48'), 'ENAME': 'FORD', 'DEPTNO': '20'}
{'_id': ObjectId('6232b71828e9c474dad71b49'), 'ENAME': 'MILLER', 'DEPTNO': '10'}

In [14]:
import pprint

result = db.emp.find().sort("ENAME")

for list in result:
    pprint.pprint(list)

{'DEPTNO': '20',
 'EMPNO': '7876',
 'ENAME': 'ADAMS',
 'HIREDATE': '1987-07-13',
 'JOB': 'CLERK',
 'MGR': '7788',
 'SAL': '1100.00',
 '_id': ObjectId('6232b71828e9c474dad71b46')}
{'COMM': '300.00',
 'DEPTNO': '30',
 'EMPNO': '7499',
 'ENAME': 'ALLEN',
 'HIREDATE': '1981-02-20',
 'JOB': 'SALESMAN',
 'MGR': '7698',
 'SAL': '1600.00',
 '_id': ObjectId('6232b71828e9c474dad71b3d')}
{'DEPTNO': '30',
 'EMPNO': '7698',
 'ENAME': 'BLAKE',
 'HIREDATE': '1981-05-01',
 'JOB': 'MANAGER',
 'MGR': '7839',
 'SAL': '2850.00',
 '_id': ObjectId('6232b71828e9c474dad71b41')}
{'DEPTNO': '10',
 'EMPNO': '7782',
 'ENAME': 'CLARK',
 'HIREDATE': '1981-06-09',
 'JOB': 'MANAGER',
 'MGR': '7839',
 'SAL': '2450.00',
 '_id': ObjectId('6232b71828e9c474dad71b42')}
{'DEPTNO': '20',
 'EMPNO': '7902',
 'ENAME': 'FORD',
 'HIREDATE': '1981-12-03',
 'JOB': 'ANALYST',
 'MGR': '7566',
 'SAL': '3000.00',
 '_id': ObjectId('6232b71828e9c474dad71b48')}
{'DEPTNO': '30',
 'EMPNO': '7900',
 'ENAME': 'JAMES',
 'HIREDATE': '1981-12-03',
 'JOB': 'CLERK',
 'MGR': '7698',
 'SAL': '950.00',
 '_id': ObjectId('6232b71828e9c474dad71b47')}
{'DEPTNO': '20',
 'EMPNO': '7566',
 'ENAME': 'JONES',
 'HIREDATE': '1981-04-02',
 'JOB': 'MANAGER',
 'MGR': '7839',
 'SAL': '2975.00',
 '_id': ObjectId('6232b71828e9c474dad71b3f')}
{'DEPTNO': '10',
 'EMPNO': '7839',
 'ENAME': 'KING',
 'HIREDATE': '1981-11-17',
 'JOB': 'PRESIDENT',
 'SAL': '5000.00',
 '_id': ObjectId('6232b71828e9c474dad71b44')}
{'COMM': '1400.00',
 'DEPTNO': '30',
 'EMPNO': '7654',
 'ENAME': 'MARTIN',
 'HIREDATE': '1981-09-28',
 'JOB': 'SALESMAN',
 'MGR': '7698',
 'SAL': '1250.00',
 '_id': ObjectId('6232b71828e9c474dad71b40')}
{'DEPTNO': '10',
 'EMPNO': '7934',
 'ENAME': 'MILLER',
 'HIREDATE': '1982-01-23',
 'JOB': 'CLERK',
 'MGR': '7782',
 'SAL': '1300.00',
 '_id': ObjectId('6232b71828e9c474dad71b49')}
{'DEPTNO': '20',
 'EMPNO': '7788',
 'ENAME': 'SCOTT',
 'HIREDATE': '1987-06-28',
 'JOB': 'ANALYST',
 'MGR': '7566',
 'SAL': '3000.00',
 '_id': ObjectId('6232b71828e9c474dad71b43')}
{'DEPTNO': '20',
 'EMPNO': '7369',
 'ENAME': 'SMITH',
 'HIREDATE': '1980-12-17',
 'JOB': 'CLERK',
 'MGR': '7902',
 'SAL': '800.00',
 '_id': ObjectId('6232b71828e9c474dad71b3c')}
{'COMM': '0.00',
 'DEPTNO': '30',
 'EMPNO': '7844',
 'ENAME': 'TURNER',
 'HIREDATE': '1981-09-08',
 'JOB': 'SALESMAN',
 'MGR': '7698',
 'SAL': '1500.00',
 '_id': ObjectId('6232b71828e9c474dad71b45')}
{'COMM': '500.00',
 'DEPTNO': '30',
 'EMPNO': '7521',
 'ENAME': 'WARD',
 'HIREDATE': '1981-02-22',
 'JOB': 'SALESMAN',
 'MGR': '7698',
 'SAL': '1250.00',
 '_id': ObjectId('6232b71828e9c474dad71b3e')}

In [25]:
# $gte : 2450보다 크거나 같은 데이터만 출력
result = list(db.emp.find(
    {
        "SAL" : {
            "$gte" : 2450
        }
    }
))

for list in result:
    print(list)

TypeError: 'dict' object is not callable

In [ ]:
# $lt : 2450보다 작은 데이터만 출력
result = list(db.emp.find(
    {
        "SAL" : {
            "$lt" : 2450
        }
    }
))

for list in result:
    print(list)

### 2022/03/18

In [9]:
import pandas as pd

result = db.emp.find()
pd.DataFrame(result).head(2)

,_id,EMPNO,ENAME,JOB,MGR,HIREDATE,SAL,DEPTNO,COMM
0,6232b71828e9c474dad71b3c,7369,SMITH,CLERK,7902,1980-12-17,800.00,20,NaN
1,6232b71828e9c474dad71b3d,7499,ALLEN,SALESMAN,7698,1981-02-20,1600.00,30,300.00

In [11]:
# update_one은 조건에 부합하는 데이터가 여러개이더라도 하나의 값만 바뀜
# 조건에 맞는 모든 데이터를 바꾸고 싶다면 update_many를 사용함.
result = db.emp.update_one(
    {
        "ENAME" : "SMITH"
    },
    {
        "$set" : {
            "SAL" : 880
        }
    }
)

In [12]:
result = db.emp.find({
    "ENAME" : "SMITH"
})

pd.DataFrame(result)

                        _id EMPNO  ENAME    JOB   MGR    HIREDATE  SAL DEPTNO
0  6232b71828e9c474dad71b3c  7369  SMITH  CLERK  7902  1980-12-17  880     20
1  6232c6cd28e9c474dad71b4a  7369  SMITH  CLERK  7902  1980-12-17  800     20

In [13]:
# update_one은 조건에 부합하는 데이터가 여러개이더라도 하나의 값만 바뀜
# 조건에 맞는 모든 데이터를 바꾸고 싶다면 update_many를 사용함.
result = db.emp.update_many(
    {
        "ENAME" : "ALLEN"
    },
    {
        "$set" : {
            "SAL" : 2000
        }
    }
)

In [14]:
result = db.emp.find({
    "ENAME" : "ALLEN"
})

pd.DataFrame(result)

,_id,EMPNO,ENAME,JOB,MGR,HIREDATE,SAL,COMM,DEPTNO
0,6232b71828e9c474dad71b3d,7499,ALLEN,SALESMAN,7698,1981-02-20,2000,300.00,30
1,6232c6cd28e9c474dad71b4b,7499,ALLEN,SALESMAN,7698,1981-02-20,2000,300,30

In [15]:
result = db.emp.delete_one(
    {
        "JOB" : "PRESIDENT"
    }
)

In [16]:
result = db.emp.find({
    "JOB" : "PRESIDENT"
})

pd.DataFrame(result)

                        _id  EMPNO ENAME        JOB    HIREDATE   SAL  DEPTNO
0  6232c6cd28e9c474dad71b52   7839  KING  PRESIDENT  1981-11-17  5000      10

In [18]:
result = db.emp.find({
    "ENAME" : "KING"
})

pd.DataFrame(result)

                        _id  EMPNO ENAME        JOB    HIREDATE   SAL  DEPTNO
0  6232c6cd28e9c474dad71b52   7839  KING  PRESIDENT  1981-11-17  5000      10

In [19]:
result = db.emp.delete_many(
    {
        "ENAME" : "MILLER"
    }
)

In [20]:
result = db.emp.find({
    "ENAME" : "MILLER"
})

pd.DataFrame(result)

Empty DataFrame
Columns: []
Index: []